# -*- mode:org; mode: flyspell; -*-

#+SETUPFILE: p-common.org

#+TITLE: Discrete mathematics II. practice - Groups
#+SHORT_TITLE: Groups

* Reminder: groupoid, semi\-group, monoid, group, Abelian group 
  Let $G$ be a set.  
  - $(G,\cdot)$ is a *groupoid* if $\cdot$ is a *binary operation* of
    type $\cdot : G \times G \to G$.  Remember in $f: X \to Y$ the
    ``:'' means $\operatorname{dmn}(f) = X$.
  - The $(G,\cdot)$ group is a *semi\-group* if $\cdot$ is
    *associative* \ie $a(bc) = (ab)c$ (for each $a,b,c\in G$).
  - The $(G,\cdot)$ semi\-group is a *monoid* if there is a $e \in G$
    *element of unity* \ie $\exists e \in G \, \forall g \in G : eg =
    ge = g$
  - The monoid $(G,\cdot)$ is a *group* if all the elements are
    *invertable* \ie $\forall g \in G \, \exists g^{-1} \in G :
    gg^{-1} = g^{-1}g = e$.
  - The group $(G,\cdot)$ is an *abelian group* if the operation is
    *commutative* \ie $ab = ba$ for each $a,b \in G$.
  Note: I should be writing $a \cdot (b \cdot c) = \ldots$, but that
  would take too much time so from now on $a \cdot b = ab$.

  Let $( G, \cdot )$ be a group. Then the *order of the group* is
  $\lvert G \rvert$ \ie the number of elements in the group (or
  infinity).  Let $g\in G$, then the *order of the element* $g$ is
  $\lvert g \rvert = o(g) = \min\{n \in \mathbb{N}^+ : g^n = e\}$
  where $e$ is the unit element.  

  If $(H_i, \cdot)$ are sub\-groups of $(G, \cdot)$ (for some $i \in
  I$ indexes), then their intersection is also a subgroup \ie $H =
  \bigcap_{i \in I} H_i$ is also a subgroup of $G$.
  
  The *subgroup generated by $K$* (where $K \subseteq G$) is \[
  \langle K \rangle = \bigcap \{ H : H \le G \land K \subseteq H \} \]
  If $\langle K \rangle = G$, then $K$ is a *generating set* of $G$,
  and *$G$ is a cyclic group* if it has a one element generating set,
  \ie $\exists g \in G : \langle g \rangle = G$.

  The *multiplicative group mod $m$* is $(\mathbb{Z}_m^*, \cdot)$
  where $\mathbb{Z}_m^* = \{\overline{x} \in \mathbb{Z}_m: (x,m) =
  1\}$ \ie the set of reduced residue classes. If $m$ is prime then
  $\mathbb{Z}_m^* = \mathbb{Z}_m \setminus \{\overline{0}\}$

* Problems
  1. Examine the following examples, if they form/make a groupoid,
     semi\-group, monoid, group or abelian group?
     1) $(\mathbb{Z}, \circ)$ where $a \circ b = (a+b)/2$;
     2) $(\mathbb{Q}, \circ)$ where $a \circ b = (a+b)/2$;
     3) $(A, \circ)$ where $A$ is the set of $f : [0,1] \to
	\mathbb{R}$ functions, and $(f \circ g)(x) = \max\{f(x),
	g(x)\}$;
     4) $(\mathbb{R}, /)$ \ie real numbers with division;
     5) $(\mathbb{R}\setminus \{0\}, / )$ \ie non-zero real numbers
	with division.
  2. Show that the complex \(n\)-th roots of unity form an abelian
     group with the complex multiplication.
  3. Show that the set of all complex \(n\)-th roots of unity (for all
     $n \in \mathbb{N}$) is an abelian group.
  4. 
     1) Examine the mod $5$ residue classes \ie $\mathbb{Z}_5$
	residue classes with multiplication as the operation.
     2) Examine the mod $5$ residue class except the class
	represented by $0$ \ie $\mathbb{Z}^*_5 = \mathbb{Z}_5\setminus
	\{\overline{0}\}$ residue classes with multiplication as the
	operation.
  5. 
     1) Consider the complex 8-th roots of unity \ie $E_8$ with the
	complex multiplication as a group.  What is the order of the
	group $E_8$ and what are the orders of its elements?
     2) In this group, determine the subgroups generated by the
	elements.
     3) Is $E_8$ a cyclic group?
  6. Verify that $(\mathbb{Z}_5, +)$ is an Abelian group.
  7. Is $(\mathbb{Z}_5, \cdot)$ a group?
  8. Verify that $(\mathbb{Z}^*_5, \cdot)$ is a group, where
     $\mathbb{Z}^*_5 = \mathbb{Z}_5 \setminus \{ \overline{0} \}$.
  9. Is $(\mathbb{Z}^*_5, \cdot)$ cyclic?
  10. Is $(\mathbb{Z}_{12}, \cdot)$ a group?
  11. Is $(\mathbb{Z}_{12} \setminus \{ \overline{0} \}, \cdot)$ a
      group?
  12. Find a non trivial subgroup of $(\mathbb{Z}_{12}, \cdot)$?
  13. Verify that $(\mathbb{Z}_8^*, \cdot)$ is a group!
  14. Is $(\mathbb{Z}_8^*, \cdot)$ cyclic?
  15. Let $n=12$, in $D_n$ what are the elements of $\langle g_1
      \rangle$, $\langle g_2 \rangle$, $\langle g_1 \circ g_2 \rangle$
      and $\langle g_1, g_2 \rangle$, if $g_1 = \varepsilon^8$ and
      $g_2 = \tau \circ \varepsilon^3$?
* Solutions
  1. 
     1) Not a groupoid, because $\circ$ is not a $\circ : \mathbb{Z}
	\times \mathbb{Z} \to \mathbb{Z}$ operation, \eg $0 \circ 1 =
	(0+1)/2 = 1/2 \not\in \mathbb{Z}$;
     2) It is a groupoid, because if $a$ and $b$ are rational, then so
	is $a+b$ and $(a+b)/2$.  But it is not a semi\-group because
	$a \circ (b \circ c) = a \circ ( (b+c)/2 ) = (a+ (b+c)/2 )/2 =
	a/2 + (b+c)/4$ but $(a \circ b) \circ c = ((a+b)/2) \circ c
	=((a+b)/2 +c)/2 = (a+b)/4 + c/2$ \eg $a=0, b=0, c=1$ gives $0
	\circ (0 \circ 1) =1/4$ and $(0 \circ 0) \circ 1 = 1/2$.
     3) It is a groupoid, use common sense -- the $\circ$ of two
	functions from $A$ is also a function from $A$!  It is also a
	semi\-group because $\max$ is associative $(f \circ (g \circ
	h))(x) = \max \{ f(x), (g\circ h)(x) \} = \max \{ f(x), \max
	\{ g(x), h(x)\} \} = \max\{ f(x), g(x), h(x) \} = \ldots = ((f
	\circ g) \circ h)(x)$ (HW: fill in the $\ldots$ part).
	#+LATEX_HEADER: \usepackage{pgfplots}
	#+BEGIN_LaTeX
	\begin{tikzpicture}
	\begin{axis}[domain=-1.57:1.57,legend pos=south east]
	\addplot[mark=none,color=blue] {sin(deg(x))}; 
	\addplot[color=red] {cos(deg(x))}; 
	\addplot {max(cos(deg(x)),sin(deg(x)))}; 
	\legend{$f(x)$,$g(x)$,$(f\circ g)(x)$}
	\end{axis}
	\end{tikzpicture}
	#+END_LaTeX
     4) It is not a groupoid, because division is not an operation
	because $(x,0) \not \in \operatorname{dmn}(/)$ \ie you can not
	divide with zero or $x/0$ is not defined!
     5) It is a groupoid, because if $x,y$ are non-zero real numbers
	then so is $x/y$. But it is not a semi\-group because $(ac)/b
	= a/(b/c) \neq (a/b)/c = a/(bc)$.
     6) 
  2. $E_n = \{ w \in \mathbb{C} : w^n = 1 \}$ is the set of \(n\)-th
     roots of unity, usually we write $E_n = \{ \varepsilon_0,
     \varepsilon_1, \ldots, \varepsilon_{n-1} \}$ where $\varepsilon_k
     = \cos \frac{2\pi k }{n} + i \sin \frac{2\pi k }{n}$ where
     $k=0,1,\ldots, n-1$, so $\lvert \varepsilon_k \rvert = 1$ and the
     angle is $k$ times one \(n\)-th of a circle \ie $\frac{2\pi
     k}{n}$.
     #+BEGIN_LaTeX
     \begin{tikzpicture}
     %\draw[color=gray,dotted] (0,0) -- (1,0) -- (1,1);
     \draw[gray,dotted] (-1.5,0) -- (1.5,0) (0,-1.5) -- (0,1.5);
     \draw (0,0) circle (1);
     \def\n{8}
     \foreach[evaluate=\k as \kd using int(\k-1)] \k in {1,...,\n}{
     \def\mydeg{360/\n*\kd};
     \draw (\mydeg:0.9) -- (\mydeg:1.1);
     \node at (\mydeg:1.5) {$\varepsilon_{\kd}$};
     };
     \end{tikzpicture}
     #+END_LaTeX
     - If you have $\varepsilon, \varepsilon' \in E_n$ then
	  $\varepsilon^n = 1$ and $\varepsilon'^n = 1$ so $(\varepsilon
	  \varepsilon')^n = \varepsilon^n \varepsilon'^n = 1
	  \cdot 1 = 1$ so $\varepsilon \varepsilon' \in E_n$ is also true
	  \ie it's a groupoid.  
     - It is a semi\-group because multiplication
       in complex numbers is associative.  
     - It is a monoid because $\varepsilon_0 = 1$ is an element of
       unity.
     - If $\varepsilon_j, \varepsilon_k \in E_n$ then $\varepsilon_j
       \varepsilon_k = \varepsilon_r$ where $r = (j+k) \bmod n$
       because \[\varepsilon_j = \cos \frac{2\pi j }{n} + i \sin
       \frac{2\pi j }{n}\] and \[\varepsilon_k = \cos \frac{2\pi k
       }{n} + i \sin \frac{2\pi k }{n}\] so 
       \begin{align*}
       \varepsilon_j \varepsilon_k 
       &= \cos \frac{2\pi j + 2\pi k }{n} + 
       i \sin \frac{2\pi j + 2\pi k }{n} \\
       &= \cos \frac{2\pi (j + k) }{n} + 
       i \sin \frac{2\pi (j + k) }{n} \\
       &= \cos \frac{2\pi r + 2\pi qn }{n} + 
       i \sin \frac{2\pi r + 2\pi qn }{n} \\
       &= \cos \frac{2\pi r }{n} + 
       i \sin \frac{2\pi r }{n}
       \end{align*}
       where $q=\lfloor (i+j)/n\rfloor$. So for each $\varepsilon_k$
       if $r = (n-k) \bmod n$ \ie $r = n-k$ if $k\neq 0$ and $r=0$ if
       $k=0$ then $\varepsilon_k \varepsilon_r = \varepsilon_0 =
       1$, since $0 = k+((n-k) \bmod n) \bmod n$.
     - It is an abelian group, because the multiplication is
       commutative in $\mathbb{C}$ also.
  3. Now the set is \[E=\bigcup_{n \in \mathbb{N}} E_n = \{w \in
     \mathbb{C} : \exists n \in \mathbb{N} : w^n = 1\}\]
     - This is a groupoid because if $\varepsilon_1, \varepsilon_2 \in
       E$ then $\exists n_1, n_2 \in \mathbb{N}$ so that
       $\varepsilon_1^{n_1} = 1$ and $\varepsilon_2^{n_2}=1$.  Then
       $(\varepsilon_1\varepsilon_2)^{n_1n_2} =
       \varepsilon_1^{n_1n_2}\varepsilon_2^{n_1n_2} =
       (\varepsilon_1^{n_1})^{n_2} (\varepsilon_2^{n_2})^{n_1} =
       1^{n_2}\cdot 1^{n_1} = 1$, so $\varepsilon_1\varepsilon_2 \in
       E_{n_1n_2} \subseteq E$.
     - Multiplication is associative in $\mathbb{C}$, so $(E,\cdot)$
       is a semi\-group.
     - $1\in E$ so there is an element of unity, \ie $(E,\cdot)$ is a
       monoid.
     - $(E,\cdot)$ is a group, because if $\varepsilon \in E$ then
       there is a positive integer $n$ for which $\varepsilon \in
       E_n$, and in the previous exercise we saw that $\varepsilon$
       has an inverse $\varepsilon^{-1} \in E_n$ so $\varepsilon^{-1}
       \in E$ is also true because $E_n \subseteq E$.
     - The operation is commutative in $\mathbb{C}$ so $(E,\cdot)$ is
       an abelian group.
  4. The residue classes mod $5$ are $\{\overline{0}, \overline{1},
     \overline{2}, \overline{3}, \overline{4} \mod 5 \}$, where
     $\overline{0}$ is the residue class mod $5$ represented by $0$.
     1) The multiplication for residue classes is defined as
	$\overline{a} \cdot \overline{b} = \overline{a\cdot b}$, \ie
	the product of residue classes is the residue class
	represented by the product of the representatives.  It can be
	shown that the multiplication is independent of the choice of
	the representative \ie the product of residue classes are also
	residue classes.  The multiplication table for $\mathbb{Z}_5$:
	| $( \mathbb{Z}_5, \cdot )$ | $\overline{0}$ | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ |
	| $\overline{0}$            | $\overline{0}$ | $\overline{0}$ | $\overline{0}$ | $\overline{0}$ | $\overline{0}$ |
	| $\overline{1}$            | $\overline{0}$ | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ |
	| $\overline{2}$            | $\overline{0}$ | $\overline{2}$ | $\overline{4}$ | $\overline{1}$ | $\overline{3}$ |
	| $\overline{3}$            | $\overline{0}$ | $\overline{3}$ | $\overline{1}$ | $\overline{4}$ | $\overline{2}$ |
	| $\overline{4}$            | $\overline{0}$ | $\overline{4}$ | $\overline{3}$ | $\overline{2}$ | $\overline{1}$ |
  5. TODO
  6. So for each residue class $\overline{a}, \overline{b} \in
     \mathbb{Z}_5$, we define the product $\overline{a} \overline{+}
     \overline{b} = \overline{a+b}$, \eg $\overline{0} = \{0, 5, 10,
     \ldots -5, -10 \ldots \}$, $\overline{2} = \{2, 7, 12, \ldots,
     -3, -8, \ldots \}$, $\overline{3} = \{3, 8, 13, \ldots, -2, -7,
     \ldots \}$, so $\overline{2} + \overline{3}= \overline{2 + 3} =
     \overline{5} = \overline{0}$.

     It is a groupoid, see table bellow.  It is a semi\-group \ie it
     is associative:
     \begin{align*}
     \overline{a} + (\overline{b} + \overline{c}) 
     &=  \overline{a}+ \overline{b + c} = \\
     &= \overline{a + (b + c)} \\
     &= \overline{(a + b) + c} \\
     &= \overline{a+ b} +   \overline{c}
     = (\overline{a}+ \overline{b}) +   \overline{c}
     \end{align*}
     It has a unit element $\overline{0}$ (see table below). And every
     element has an inverse (\ie every row and column contains the
     unit element once in the table bellow).  And it is also
     commutative \ie Abelian group because $+$ on the integers is also
     commutative but you can also see it from the table bellow, since
     it is symmetrical.
     #+BEGIN_SRC C++ :exports both
       #include <iostream>
       using namespace std;
       int main()
       {
         int i,j, m = 5;
         cout << "$+$" << " ";
         for(i = 0; i < m; i++) 
	   cout << "$\\overline{" << i << "}$ ";
         cout << endl;
         for(i = 0; i < m; i++){
           cout << "$\\overline{" << i << "}$ ";
           for(j = 0; j < m; j++) 
	     cout << "$\\overline{" 
	       << (i+j) % m // !HERE!
	       << "}$ ";
           cout << endl;
         }
         return 0;
       }
     #+END_SRC

     #+RESULTS:
     | $(\mathbb{Z}_5,+)$ | $\overline{0}$ | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ |
     | $\overline{0}$     | $\overline{0}$ | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ |
     | $\overline{1}$     | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ | $\overline{0}$ |
     | $\overline{2}$     | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ | $\overline{0}$ | $\overline{1}$ |
     | $\overline{3}$     | $\overline{3}$ | $\overline{4}$ | $\overline{0}$ | $\overline{1}$ | $\overline{2}$ |
     | $\overline{4}$     | $\overline{4}$ | $\overline{0}$ | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ |
  7. No. But why? It's a groupoid, it's a semi\-group, it's a monoid
     (with $\overline{1}$ as the element of unity), but $\overline{0}$ has
     no inverse, thus it is not a group!
     #+BEGIN_SRC C++ :exports both
       #include <iostream>
       using namespace std;
       int main()
       {
         int i,j, m = 5;
         cout << "$\\cdot$" << " ";
         for(i = 0; i < m; i++) 
	   cout << "$\\overline{" << i << "}$ ";
         cout << endl;
         for(i = 0; i < m; i++){
           cout << "$\\overline{" << i << "}$ ";
           for(j = 0; j < m; j++) 
	     cout << "$\\overline{" 
	       << (i*j) % m // !HERE!
	       << "}$ ";
           cout << endl;
         }
         return 0;
       }
     #+END_SRC

     #+RESULTS:
     | $cdot$         | $\overline{0}$ | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ |
     | $\overline{0}$ | $\overline{0}$ | $\overline{0}$ | $\overline{0}$ | $\overline{0}$ | $\overline{0}$ |
     | $\overline{1}$ | $\overline{0}$ | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ |
     | $\overline{2}$ | $\overline{0}$ | $\overline{2}$ | $\overline{4}$ | $\overline{1}$ | $\overline{3}$ |
     | $\overline{3}$ | $\overline{0}$ | $\overline{3}$ | $\overline{1}$ | $\overline{4}$ | $\overline{2}$ |
     | $\overline{4}$ | $\overline{0}$ | $\overline{4}$ | $\overline{3}$ | $\overline{2}$ | $\overline{1}$ |
  8. This is a group: see discussion of $(\mathbb{Z}_5,+)$ and the
     previous problem, but now every element has an inverse.
    #+BEGIN_SRC C++ :exports both
      #include <iostream>
      using namespace std;
      int main()
      {
        int i,j, m = 5;
        cout << "$\\cdot$" << " ";
        for(i = 1; i < m; i++) 
          cout << "$\\overline{" << i << "}$ ";
        cout << endl;
        for(i = 1; i < m; i++){
          cout << "$\\overline{" << i << "}$ ";
          for(j = 1; j < m; j++) 
            cout << "$\\overline{" 
              << (i*j) % m // !HERE!
              << "}$ ";
          cout << endl;
        }
        return 0;
      }
    #+END_SRC

    #+RESULTS:
    | $\cdot$        | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ |
    | $\overline{1}$ | $\overline{1}$ | $\overline{2}$ | $\overline{3}$ | $\overline{4}$ |
    | $\overline{2}$ | $\overline{2}$ | $\overline{4}$ | $\overline{1}$ | $\overline{3}$ |
    | $\overline{3}$ | $\overline{3}$ | $\overline{1}$ | $\overline{4}$ | $\overline{2}$ |
    | $\overline{4}$ | $\overline{4}$ | $\overline{3}$ | $\overline{2}$ | $\overline{1}$ |
  9. Yes, because $\langle \overline{2} \rangle = \langle
     \overline{3} \rangle = \mathbb{Z}_5^*$, \ie 2 and 3 are
     generators of the group. \Eg $\langle \overline{2} \rangle = \{
     \overline{2}^0 = \overline{1}, \overline{2}^1 = \overline{2},
     \overline{2}^2 = \overline{4}, \overline{2}^3 = \overline{3},
     \overline{2}^4 = \overline{1}, \ldots \}$. Important: we should
     have checked $\overline{2}^{-1} = \overline{3},
     \overline{2}^{-2} = (\overline{2}^{-1})^2 = \overline{3}^2 =
     \overline{4} = (\overline{2}^2)^{-1} = \overline{4}^{-1},
     \ldots$ too!!!
  10. No, it is not a group. $\overline{0}$ does not have an inverse
      (see $(\mathbb{Z}_5, \cdot)$).
       #+BEGIN_SRC C++ :exports both
         #include <iostream>
         using namespace std;
         int main()
         {
           int i,j, m = 12;
           // No header and first column to make
           // the table smaller
           // cout << "$\\cdot$" << " ";
           // for(i = 0; i < m; i++) 
           //   cout << "$\\overline{" << i << "}$ ";
           cout << endl;
           for(i = 0; i < m; i++){
             // cout << "$\\overline{" << i << "}$ ";
             for(j = 0; j < m; j++) 
               cout << "$\\overline{" 
                 << (i*j) % m 
                 << "}$ "; // !HERE!
             cout << endl;
           }
           return 0;
         }
     #+END_SRC

       #+RESULTS:
       | $\cdot$         | $\overline{0}$ | $\overline{1}$  | $\overline{2}$  | $\overline{3}$ | $\overline{4}$ | $\overline{5}$  | $\overline{6}$ | $\overline{7}$  | $\overline{8}$ | $\overline{9}$ | $\overline{10}$ | $\overline{11}$ |
       | $\overline{0}$  | $\overline{0}$ | $\overline{0}$  | $\overline{0}$  | $\overline{0}$ | $\overline{0}$ | $\overline{0}$  | $\overline{0}$ | $\overline{0}$  | $\overline{0}$ | $\overline{0}$ | $\overline{0}$  | $\overline{0}$  |
       | $\overline{1}$  | $\overline{0}$ | $\overline{1}$  | $\overline{2}$  | $\overline{3}$ | $\overline{4}$ | $\overline{5}$  | $\overline{6}$ | $\overline{7}$  | $\overline{8}$ | $\overline{9}$ | $\overline{10}$ | $\overline{11}$ |
       | $\overline{2}$  | $\overline{0}$ | $\overline{2}$  | $\overline{4}$  | $\overline{6}$ | $\overline{8}$ | $\overline{10}$ | $\overline{0}$ | $\overline{2}$  | $\overline{4}$ | $\overline{6}$ | $\overline{8}$  | $\overline{10}$ |
       | $\overline{3}$  | $\overline{0}$ | $\overline{3}$  | $\overline{6}$  | $\overline{9}$ | $\overline{0}$ | $\overline{3}$  | $\overline{6}$ | $\overline{9}$  | $\overline{0}$ | $\overline{3}$ | $\overline{6}$  | $\overline{9}$  |
       | $\overline{4}$  | $\overline{0}$ | $\overline{4}$  | $\overline{8}$  | $\overline{0}$ | $\overline{4}$ | $\overline{8}$  | $\overline{0}$ | $\overline{4}$  | $\overline{8}$ | $\overline{0}$ | $\overline{4}$  | $\overline{8}$  |
       | $\overline{5}$  | $\overline{0}$ | $\overline{5}$  | $\overline{10}$ | $\overline{3}$ | $\overline{8}$ | $\overline{1}$  | $\overline{6}$ | $\overline{11}$ | $\overline{4}$ | $\overline{9}$ | $\overline{2}$  | $\overline{7}$  |
       | $\overline{6}$  | $\overline{0}$ | $\overline{6}$  | $\overline{0}$  | $\overline{6}$ | $\overline{0}$ | $\overline{6}$  | $\overline{0}$ | $\overline{6}$  | $\overline{0}$ | $\overline{6}$ | $\overline{0}$  | $\overline{6}$  |
       | $\overline{7}$  | $\overline{0}$ | $\overline{7}$  | $\overline{2}$  | $\overline{9}$ | $\overline{4}$ | $\overline{11}$ | $\overline{6}$ | $\overline{1}$  | $\overline{8}$ | $\overline{3}$ | $\overline{10}$ | $\overline{5}$  |
       | $\overline{8}$  | $\overline{0}$ | $\overline{8}$  | $\overline{4}$  | $\overline{0}$ | $\overline{8}$ | $\overline{4}$  | $\overline{0}$ | $\overline{8}$  | $\overline{4}$ | $\overline{0}$ | $\overline{8}$  | $\overline{4}$  |
       | $\overline{9}$  | $\overline{0}$ | $\overline{9}$  | $\overline{6}$  | $\overline{3}$ | $\overline{0}$ | $\overline{9}$  | $\overline{6}$ | $\overline{3}$  | $\overline{0}$ | $\overline{9}$ | $\overline{6}$  | $\overline{3}$  |
       | $\overline{10}$ | $\overline{0}$ | $\overline{10}$ | $\overline{8}$  | $\overline{6}$ | $\overline{4}$ | $\overline{2}$  | $\overline{0}$ | $\overline{10}$ | $\overline{8}$ | $\overline{6}$ | $\overline{4}$  | $\overline{2}$  |
       | $\overline{11}$ | $\overline{0}$ | $\overline{11}$ | $\overline{10}$ | $\overline{9}$ | $\overline{8}$ | $\overline{7}$  | $\overline{6}$ | $\overline{5}$  | $\overline{4}$ | $\overline{3}$ | $\overline{2}$  | $\overline{1}$  |
  11. It is not even a groupoid, because \eg $\overline{2} \cdot
      \overline{6} = \overline{0}$.
       #+BEGIN_SRC C++ :exports both
         #include <iostream>
         using namespace std;
         int main()
         {
           int i,j, m = 12;
	   // No header and first column to make
	   // the table smaller
           // cout << "$\\cdot$" << " ";
           // for(i = 1; i < m; i++) 
	   //   cout << "$\\overline{" << i << "}$ ";
           // cout << endl;
           for(i = 1; i < m; i++){
             // cout << "$\\overline{" << i << "}$ ";
             for(j = 1; j < m; j++) 
	       cout << "$\\overline{" 
	         << (i*j) % m // !HERE!
		 << "}$ ";
             cout << endl;
           }
           return 0;
         }
     #+END_SRC
  12. Which are the problematic elements? The ones which are not
      relative prime to the modulus \ie $x$ has no inverse if
      $(x,12)\neq 1$.
      #+BEGIN_SRC C++ :exports both
	#include <iostream>
	using namespace std;
	int gcd(int a, int b){
           if( b == 0 ) return a;
           return gcd(b, a%b);
	}
	int main()
	{
          int i,j, m = 12;
          cout << "$\\cdot$" << " ";
          for(i = 0; i < m; i++) { 
            if( gcd(i,m) != 1 ) continue;
            cout << "$\\overline{" << i << "}$ ";
          }
          cout << endl;
          for(i = 0; i < m; i++){
            if( gcd(i,m) != 1 ) continue;
            cout << "$\\overline{" << i << "}$ ";
            for(j = 1; j < m; j++){
              if( gcd(j,m) != 1 ) continue;
              cout << "$\\overline{" 
	        << (i*j) % m  // !HERE!
		<< "}$ ";
            }
            cout << endl;
          }
          return 0;
	}
      #+END_SRC
  13. See the Cayley table (multiplication table):
      #+BEGIN_SRC C++ :exports both
	#include <iostream>
	using namespace std;
	int gcd(int a, int b){
           if( b == 0 ) return a;
           return gcd(b, a%b);
	}
	int main()
	{
          int i,j, m = 8;
          cout << "$\\cdot$" << " ";
          for(i = 0; i < m; i++) { 
            if( gcd(i,m) != 1 ) continue;
            cout << "$\\overline{" << i << "}$ ";
          }
          cout << endl;
          for(i = 0; i < m; i++){
            if( gcd(i,m) != 1 ) continue;
            cout << "$\\overline{" << i << "}$ ";
            for(j = 1; j < m; j++){
              if( gcd(j,m) != 1 ) continue;
              cout << "$\\overline{" 
	        << (i*j) % m // !HERE!
		<< "}$ ";
            }
            cout << endl;
          }
          return 0;
	}
      #+END_SRC
  14. No, it is not cyclic
      - $\langle \overline{1} \rangle=\{\overline{1}\}$
      - $\langle \overline{3} \rangle=\{\overline{1}, \overline{3}\}$
      - $\langle \overline{5} \rangle=\{\overline{1}, \overline{5}\}$
      - $\langle \overline{7} \rangle=\{\overline{1}, \overline{7}\}$
  15. Consider the theorem which states: 
      \begin{align*}
      \langle K \rangle &= \bigcap \{ H : H \le G \land K \subset H \} \\
      & =\{ g_1 \cdot g_2 \cdots g_n : n \in \mathbb{N}, 1 \le i \le n, g_i \in
      K \cup K ^{-1} \}
      \end{align*}
      The first line defines $\langle K \rangle$ as the smallest group
      which contains $K$ (\ie the intersection of all subgroups) and
      the second line say that this can be achieved by taking all the
      possible finite products of elements from $K \cup K^{-1}$.  For
      the special case of cyclic (sub)groups \ie (sub)groups generated
      by one element \[ \langle g \rangle = \{ g^k : k \in \mathbb{Z}
      \} \]
      - $\langle \varepsilon^8 \rangle = \{ \varepsilon^8,
        \varepsilon^4, \varepsilon^0 = e \}$ since $g_1^0 = e$ is
        always in the (sub)group, $g_1^1 = \varepsilon^8$, $g_1^{-1}=
        \varepsilon^4$, $g_1^2 = \varepsilon^{16}= \varepsilon^4$,
        $g_1^{-2} = (g_1^{-1})^2 = (\varepsilon^4)^2 = \varepsilon^8$,
        $g_1^3 = \varepsilon^{24} = e$, $g_1^{-3} = \varepsilon^{12} =
        e$, $g_1^4 = \varepsilon^{32}= \varepsilon^8$, $g_1^{-4} =
        \varepsilon^{16} = \varepsilon^4$ and it's easy to see the
        pattern.
      - $\langle \tau \circ \varepsilon^3 \rangle = \{ \tau \circ
        \varepsilon^3, e\}$ because $(\tau \circ \varepsilon^3)^2 =
        \tau \circ \varepsilon^3 \circ \tau \circ \varepsilon^3 = \tau
        \circ \varepsilon^3 \circ \varepsilon^9 \circ \tau = \tau
        \circ \tau = e$, which also implies that $g_2^{-1} = ( \tau
        \circ \varepsilon^3 )^{-1} = \tau \circ \varepsilon^3 = g_2$.
      - $\langle g_1 \circ g_2 \rangle = \langle \varepsilon^8 \circ
        \tau \circ \varepsilon^3 \rangle = \langle \tau \circ
        \varepsilon^4 \circ \varepsilon^3 \rangle = \langle \tau \circ
        \varepsilon^7 \rangle = \{e, \tau \circ \varepsilon^7 \}$.
      - Now $\langle g_1, g_2 \rangle = \langle \varepsilon^8, \tau
        \circ \varepsilon^3 \rangle$ is a little bit more
        complicated. Let this subgroup be $H = \langle g_1, g_2
        \rangle$. You need to make all the finite product of the form
        $g'_1 \cdot g'_2 \cdots g'_n$ where each $g'_i$ is either $g_1
        = \varepsilon^8$ or $g_1^{-1} = \varepsilon^4$ or $g_2 = \tau
        \circ \varepsilon^3$ or $g_2^{-1} = g_2 = \tau \circ
        \varepsilon^3$.
	- Each (sub)group contains the identity element,
          so $e\in H$,
	- but the generating elements are also in the
          generating subgroup, so $\varepsilon^8, \tau \circ
          \varepsilon^3 \in H$,
	- For now we have $H=\{e, \varepsilon^8, \tau \circ
          \varepsilon^3, \ldots \}$
	- The inverse of all the elements of $H$ should also be
          included in $H$, so $e^{-1} = e$ and $(\tau \circ
          \varepsilon^3)^{-1} = \tau \circ \varepsilon$ are already
          included, but $(\varepsilon^8)^{-1} = \varepsilon^4$ should
          be added so now $H = \{ e, \varepsilon^4, \varepsilon^8,
          \tau \circ \varepsilon^3, \ldots \}$
	- It is easy to check that combining $\varepsilon^4$ and
          $\varepsilon^8$ with $\tau \circ \varepsilon^3$ (or the
          other way around) you get $\tau \circ \varepsilon^7$ and
          $\tau \circ \varepsilon^{11}$, and no we have $H = \{ e,
          \varepsilon^4, \varepsilon^8, \tau \circ \varepsilon^3, \tau
          \circ \varepsilon^7, \tau \circ \varepsilon^{11} \}$ which
          is the final result, because we got it using only elements
          $g_1$ and $g_2$ (and their inverses and multiplication) and
          it is easy to check that this is a (sub)group, \ie however
          you multiply two elements of $H$, the product will also be
          in $H$.
* COMMENT 
  4. $\varphi(n) = \overline{n \bmod 5}$ is a homo\-morphism from
     $\mathbb{Z}$ to $\mathbb{Z}_5$.  If $\overline{x},\overline{y}
     \in \mathbb{Z}_5$, then \[\overline{x} = \{5q+x : q \in
     \mathbb{Z} \} \text{ and } \overline{y} = \{5s+y : s \in
     \mathbb{Z} \}\] so 
     \begin{align*}
     \overline{x} + \overline{y} =& 
     \{ (5q + x) + (5s+y) : q \in \mathbb{Z} \land \mathbb{Z} \}\\
     =& \{ 5(q+s) + (x+y) : q \in \mathbb{Z} \land \mathbb{Z} \}\\
     =& \{ 5r + z : r \in \mathbb{Z} \}\\
     \overline{x} \cdot \overline{y} =& 
     \{ (5q+x)\cdot (5s+y) : q \in \mathbb{Z} \land s \in \mathbb{Z} \} \\
     =& \{25qs + 5(qy+sx) + xy : q,s \in \mathbb{Z}\} \\
     =& \{ 5r + z : r \in \mathbb{Z} \} = \overline{xy}
     \end{align*}
